# -*- coding: utf-8 -*-
'''
Created on 2017年3月7日

@author: AppleWang
'''

# -----------------------------------
# 全局数据驱动配置
# -----------------------------------

#------------------------------------
#序列类型数据示例，使用方式：self.casedata
mydata= ['111','222','333','444'] 
#------------------------------------

#------------------------------------
#字典类型数据示例，使用方式self.casedata['user'],self.casedata['password']
logindata2=[ { 'user1':'18320967034','password1':'123456','mid1':'100099541','cid1':'100093445',
            'user':'18028781683','password':'111111','mid':'100091965','cid':'100011724',
            'user2':'18152504578','password2':'999999','mid2':'100119062','cid2':'100009009'}
            ]

logindata1=[{'user1':'18320967034','password1':'123456','mid1':'2198874','cid1':'2187933','status1':'use',
            'user2':'18126162157','password2':'123456','mid2':'2198806','cid2':'2187888','status2':'unuse',
            'user':'18028781683','password':'111111','mid':'2182942','cid':'2025168','status':'unuse'
             }]

#logindata3=[{'user':'18028781683','password':'111111','mid':'2182942','cid':'2025168'}] #预发布ID信息
logindata3=[{'user':'18004665243','password':'123456','cid':'100001955'}] #预发布ID信息
logindata4=[{'user':'18126162157','password':'123456','mid':'2198806','cid':'2187888',
             'user1':'18126162157','password1':'123456','mid1':'11844718','cid1':'10560477',
             'user2':'18126162157','password2':'123456','cid2':'100092904','mid2':'100098611'}]#user测试服，user1正式服，user2预发布
logindata5=[{'user2':'13079931836','password2':'123456','cid2':'100110878','mid2':'100118181'}]
cid=[{'cid1':'10624914'}]
#------------------------------------

