# -*- coding: utf-8 -*-
'''
Created on 2017年3月7日

@author: AppleWang
'''

# -----------------------------------
# 全局数据驱动配置
# -----------------------------------

#------------------------------------
#序列类型数据示例，使用方式：self.casedata
mydata= ['111','222','333','444'] 
#------------------------------------

#------------------------------------
#字典类型数据示例，使用方式self.casedata['user'],self.casedata['password']
logindata1=[{'user':'18028781683','password':'111111'}]
logindata2=[{'user':'18028781683','password':'111111','mid':'2182942','cid':'2025168',
             'user1':'18320967034','password1':'123456','mid1':'2198874','cid1':'2187933',
             'user2':'13723303736','password2':'123456',
             'user3':'18000000154','password3':'123456'}]

#logindata3=[{'user':'18028781683','password':'111111','mid':'2182942','cid':'2025168'}] #测试服ID信息
logindata3=[{'user':'18028781683','password':'111111','mid':'100091965','cid':'100011724'}] #预发布ID信息
logindata4=[{'user':'18126162157','password':'123456','mid':'2198806','cid':'2187888','user1':'18126162157','password1':'123456','mid1':'11844718','cid1':'10560477'}]#user测试服，user1正式服
#------------------------------------

